dewayne57/PIC18F__Q43/03 I2C/I2C 02 Module Host/i2c.c
/* *****************************************************************************************
 *   File Name: i2c.h
 *   Description: I2C hardware module interface for the demonstration project.
 *   Author: Dewayne Hafenstein
 *   Date: 2026-05-19
 *
 *   Copyright (c) 2026, Dewayne Hafenstein.
 *   Licensed under the Apache License, Version 2.0 (the "License");
 *   you may not use this file except in compliance with the License.
 *   You may obtain a copy of the License at
 *
 *       http://www.apache.org/licenses/LICENSE-2.0
 *
 *   Unless required by applicable law or agreed to in writing, software
 *   distributed under the License is distributed on an "AS IS" BASIS,
 *   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *   See the License for the specific language governing permissions and
 *   limitations under the License.
 *
 *   This include file provides the data structures, constants, and function prototypes
 *   for the I2C hardware module interface.  The I2C module is used to communicate with
 *   external devices that support the I2C protocol, such as the MCP23017 I/O expander
 *   used in this demonstration project.  These functions are the basis for a reusable
 *   I2C library that can be used in other projects.
 * 
 *   This code comprises a reusable I2C library that can be used in other projects. 
 *   The library provides a simple interrupt-driven interface to the I2C hardware module,
 *   allowing for easy communication with external devices that support the I2C protocol. 
 *   The library is designed to be flexible and configurable, allowing for different I2C
 *   channels, clock sources, and modes of operation.  The library also provides error
 *   handling and timeout functionality to ensure reliable communication with external
 *   devices.
 ***************************************************************************************** */

#include <xc.h>
#include <stdio.h>
#include <stdbool.h>
#include <string.h>
#include "config.h"
#include "i2c.h"
#include "../../Libraries/INTLIB/intlib.h"
#include "../../Libraries/PPSLIB/pps.h"

/// @brief Array of I2C handle structures for each channel.  This array is used to store the
/// configuration and state of the I2C module for each channel.  The array is indexed
/// by the I2C channel number (1 or 2).  The channel number is decremented by 1 to 
/// index this array since arrays are 0-based. The array is initialized to zero.  The array is
/// used to record the addresses of each handle so that the interrupt service routines
/// can update the appropriate buffers and handles. 
static I2C_Handle_t* i2cHandles[2]; 

// Forward definitions of all the internal functions that are not exposed to the user.
// These functions are used to validate the I2C handle structure and to perform the
// actual I2C read and write operations.  
static bool isHandleValid(I2C_Handle_t* handle);
static void cacheHandle(I2C_Handle_t* handle);
static void setupDeviceAddress(I2C_Handle_t* handle, uint16_t deviceAddress, bool read);
static void handleErrorInterrupt(I2C_Handle_t* handle);
static void handleGeneralInterrupt(I2C_Handle_t* handle);
static void handleReceiveInterrupt(I2C_Handle_t* handle);
static void handleTransmitInterrupt(I2C_Handle_t* handle);

#ifdef VECTORED_INTERRUPTS_ENABLED
#ifdef I2C1CON0
/// @brief I2C1 error interrupt service routine.
/// @param None
/// @return None
void __interrupt(irq(I2C1E), high_priority) I2C1_Error_ISR(void)
{
    I2C_Handle_t* handle = i2cHandles[0]; // Get the handle for I2C channel 1
    if (!isHandleValid(handle))
    {
        return; // Handle is not valid, exit the ISR
    }

    handleErrorInterrupt(handle); // Call the error interrupt handler
}

/// @brief I2C1 general interrupt service routine.
/// @param None
/// @return None
void __interrupt(irq(I2C1), high_priority) I2C1_General_ISR(void)
{
    I2C_Handle_t* handle = i2cHandles[0]; // Get the handle for I2C channel 1
    if (!isHandleValid(handle))
    {
        PIR7bits.I2C1IF = 0;
        return; // Handle is not valid, exit the ISR
    }

    handleGeneralInterrupt(handle); // Call the general interrupt handler
    PIR7bits.I2C1IF = 0;
}

/// @brief I2C1 Receive interrupt service routine.
/// @param None
/// @return None
void __interrupt(irq(I2C1RX), high_priority) I2C1_Receive_ISR(void)
{
    I2C_Handle_t* handle = i2cHandles[0]; // Get the handle for I2C channel 1
    if (!isHandleValid(handle))
    {
        return; // Handle is not valid, exit the ISR
    }

    handleReceiveInterrupt(handle); // Call the receive interrupt handler
}

/// @brief  I2C1 Transmit interrupt service routine.  This interrupt is triggered when the
/// data count > 0 and the transmit buffer is empty.  The interrupt service routine should
/// load the next byte of data into the transmit buffer.  If the data count is 0, the interrupt
/// service routine should disable the transmit interrupt and set the I2C bus state to idle.
/// @param None
/// @return None
void __interrupt(irq(I2C1TX), high_priority) I2C1_Transmit_ISR(void)
{
    I2C_Handle_t* handle = i2cHandles[0]; // Get the handle for I2C channel 1
    if (!isHandleValid(handle))
    {
        return; // Handle is not valid, exit the ISR
    }
    handleTransmitInterrupt(handle); // Call the transmit interrupt handler
}
#endif
#else
#ifdef I2C2CON0
/// @brief I2C2 error interrupt service routine.
/// @param None
/// @return None
void __interrupt(irq(I2C2E), high_priority) I2C2_Error_ISR(void)
{
    I2C_Handle_t* handle = i2cHandles[1]; // Get the handle for I2C channel 1
    if (!isHandleValid(handle))
    {
        return; // Handle is not valid, exit the ISR
    }

    handleErrorInterrupt(handle); // Call the error interrupt handler
}

/// @brief I2C2 Receive interrupt service routine.
/// @param None
/// @return None
void __interrupt(irq(I2C2RX), high_priority) I2C2_Receive_ISR(void)
{
    I2C_Handle_t* handle = i2cHandles[1]; // Get the handle for I2C channel 1
    if (!isHandleValid(handle))
    {
        return; // Handle is not valid, exit the ISR
    }

    handleReceiveInterrupt(handle); // Call the receive interrupt handler
}

