dewayne57/PIC18F__Q43/03 I2C/I2C 02 Module Host/i2c.c
/// @brief  I2C2 Transmit interrupt service routine.  This interrupt is triggered when the
/// data count > 0 and the transmit buffer is empty.  The interrupt service routine should
/// load the next byte of data into the transmit buffer.  If the data count is 0, the interrupt
/// service routine should disable the transmit interrupt and set the I2C bus state to idle.
/// @param None
/// @return None
void __interrupt(irq(I2C2TX), high_priority) I2C2_Transmit_ISR(void)
{
    I2C_Handle_t* handle = i2cHandles[1]; // Get the handle for I2C channel 1
    if (!isHandleValid(handle))
    {
        return; // Handle is not valid, exit the ISR
    }
    handleTransmitInterrupt(handle); // Call the transmit interrupt handler
}
#endif
#endif

/// @brief Get the last status code for the specified I2C handle.
/// @param handle Pointer to the I2C handle structure.
/// @return The last error code for the specified I2C handle.  If the handle is NULL, the
/// function returns NO_HANDLE.
I2C_Status_t I2C_GetLastStatus(I2C_Handle_t* handle)
{
    if (!isHandleValid(handle))
    {
        return I2C_INVALID_HANDLE; // Return an error code indicating that the handle is invalid
    }
    return handle->lastStatus; // Return the last state stored in the handle
}

/// @brief Initialize the I2C module.
/// @param handle Pointer to the I2C handle structure to be created by the init code.
/// @param channel I2C channel to be initialized (0 or 1).
/// @param clockSource I2C clock source to be used (FOSC/4, FOSC, HFINTOSC, MFINTOSC, CLKREF,
/// EXTREF, TMR0, TMR2, TMR4, TMR6, SMT, CLC1-8).
/// @param mode I2C mode to be used (master or slave).
/// @param timeout Timeout value for I2C operations (in milliseconds).  If zero, no timeout
/// will be used.  If non-zero, and a timeout source has been defined, the I2C module will
/// timeout if the operation takes longer than the specified timeout value.
/// @param timeoutSource Timeout source to be used for I2C operations (timer or CLC).  If no
/// timeout source is defined, the timeout parameter will be ignored.  If a timeout source
/// is defined, the I2C module will timeout if the operation takes longer than the specified
/// timeout value.
/// @return I2C status indicating success or failure.  The provided handle will be initialized
/// if the function returns I2C_STATUS_SUCCESS.  If the function returns I2C_STATUS_ERROR, the
/// handle will not be initialized and should not be used.
I2C_Status_t I2C_Init(I2C_Handle_t* handle, I2C_Channel_t channel, I2C_Clock_t clockSource,
                      I2C_Mode_t mode, uint16_t timeout, I2C_Timeout_Source_t timeoutSource)
{

    if (handle == NULL)
    {
        return I2C_INVALID_HANDLE; // Return an error code indicating that the handle is invalid
    }

    // Check if the handle has already been initialized
    if (isHandleValid(handle) && handle->initialized)
    {
        handle->lastStatus = I2C_OK; // Set the last state to OK
        return I2C_OK;               // Return success status if the handle is already initialized
    }

    memset(handle, 0, sizeof(I2C_Handle_t));  // Clear the handle structure
    handle->signature = I2C_HANDLE_SIGNATURE; // Set the handle signature to indicate that
                                              // the handle is valid

    // Validate the input parameters and set the last state in the handle accordingly
    if (mode != I2C_MODE_MASTER_7 && mode != I2C_MODE_MASTER_10 && mode != I2C_MULTI_MASTER_7 &&
        mode != I2C_MULTI_MASTER_10)
    {
        handle->lastStatus = I2C_INVALID_MODE; // Set the last state to invalid mode
        return I2C_INVALID_MODE; // Return an error code indicating that the mode is invalid
    }

    if (!((clockSource <= I2C_CLOCK_TMR6_POST) ||
          (clockSource >= I2C_CLOCK_SMT && clockSource <= I2C_CLOCK_CLC8)))
    {
        handle->lastStatus = I2C_INVALID_CLOCK_SOURCE; // Set the last state to invalid clock source
        return I2C_INVALID_CLOCK_SOURCE; // Return an error code indicating that the clock source is
                                         // invalid
    }

    if (channel == I2C_CHANNEL_1)
    {
#ifndef I2C1CON0
        handle->lastStatus = I2C_INVALID_CHANNEL; // Set the last state to invalid channel
        return I2C_INVALID_CHANNEL; // Return an error code indicating that the channel is invalid
#endif
    }
    if (channel == I2C_CHANNEL_2)
    {
#ifndef I2C2CON0
        handle->lastStatus = I2C_INVALID_CHANNEL; // Set the last state to invalid channel
        return I2C_INVALID_CHANNEL; // Return an error code indicating that the channel is invalid
#endif
    }
    if (channel != I2C_CHANNEL_1 && channel != I2C_CHANNEL_2)
    {
        handle->lastStatus = I2C_INVALID_CHANNEL; // Set the last state to invalid channel
        return I2C_INVALID_CHANNEL; // Return an error code indicating that the channel is invalid
    }

    // Now, set up the I2C structure and initialize the I2C hardware module based on the provided
    // parameters
    handle->channel = channel;             // Store the channel in the handle
    handle->clockSource = clockSource;     // Store the clock source in the handle
    handle->mode = mode;                   // Store the mode in the handle
    handle->timeout = timeout;             // Store the timeout value in the handle
    handle->timeoutSource = timeoutSource; // Store the timeout source in the handle
    cacheHandle(handle);

    // setup the I2C pins as open drain outputs
    TRISCbits.TRISC3 = 0; // RC3 is defined as output
    TRISCbits.TRISC4 = 0; // RC4 is output
    ODCONCbits.ODCC3 = 1; // Open Drain
    ODCONCbits.ODCC4 = 1; // Open drain

    // Set up the PPS (Peripheral Pin Select) so the module is routed to RC3/RC4.
    CRITICAL_SECTION_START();
    PPS_Unlock();
    I2C1SCLPPS = 0x13; // RC3 input mapping
    I2C1SDAPPS = 0x14; // RC4 input mapping
    RC3PPS = 0x37;     // I2C1 SCL output mapping
    RC4PPS = 0x38;     // I2C1 SDA output mapping
    PPS_Lock();
    CRITICAL_SECTION_END();

    RC3I2Cbits.I2CSLEW = 0b11; // Fast mode slew rate
    RC3I2Cbits.I2CPU = 0b10;   // 10X pullup
    RC3I2Cbits.I2CTH = 0b01;   // I2C thresholds
    RC4I2Cbits.I2CSLEW = 0b11;
    RC4I2Cbits.I2CPU = 0b10;
    RC4I2Cbits.I2CTH = 0b01;

    // If a timer timeout source was defined and a non-zero timeout value was provided, configure
    // the timer for the specified timeout value.  Note, the timeout value is in milliseconds, so
    // the timer must be configured to generate an interrupt after the specified number of
    // milliseconds.
    if ((timeoutSource == TIMER2 || timeoutSource == TIMER4 || timeoutSource == TIMER6) &&
        timeout > 0)
    {
        // configure the pre-scaller, post-scaler, and period registers for the system clock
        // speed (defined by _XTAL_FREQ) and the specified timeout value.  The timer will be
        // configured to generate an interrupt after the post scaler has counted the specified
        // number of timer overflows.
        uint32_t timerFrequency = _XTAL_FREQ / 4; // Timer frequency is FOSC/4
        uint8_t prescaler = 1;                    // Default prescaler value
        uint8_t postscaler = 1;                   // Default postscaler value
        uint32_t timerTicks =
            (timerFrequency / 1000) * timeout; // Calculate the number of timer ticks
        // The timer is an 8-bit counter, so the maximum number of ticks is 256.  If the number
        // of ticks is greater than 256, we need to use a pre-scaler and post-scaler to divide the
        // timer frequency.  The pre-scaler and post-scaler can be set to 1, 2, 4, 8, 16, 32, 64,
        // or 128.  We will use the smallest pre-scaler and post-scaler that will allow us to fit
        // the number of ticks into the 8-bit counter.
        uint32_t overflow = timerTicks / 256; // Calculate the number of overflows needed
        do
        {
            timerTicks = timerTicks / prescaler;  // Divide the number of ticks by the prescaler
            timerTicks = timerTicks / postscaler; // Divide the number of ticks by the postscaler

            overflow = timerTicks / 256; // Calculate the number of overflows needed
            if (overflow > 0)
            {
                if (prescaler < 128)
                {
                    prescaler *= 2; // Double the prescaler value
                }
                else if (postscaler < 16)
                {
                    postscaler++; // increment the postscaler value
                }
                else
                {
                    handle->lastStatus =
                        I2C_INVALID_TIMEOUT_VALUE;    // Set the last state to invalid timeout value
                    return I2C_INVALID_TIMEOUT_VALUE; // Return an error code indicating that the
                                                      // timeout value is invalid
                }
            }
        } while (overflow > 0);
        uint8_t preScaleExponent = 0;
        while (prescaler > 1)
        {
            prescaler /= 2;
            preScaleExponent++;
        }

