dewayne57/PIC18F__Q43/03 I2C/I2C 02 Module Host/i2c.c
        switch (timeoutSource)
        {
        case TIMER2:
            T2CONbits.TMR2ON = 0;                        // Disable Timer2 before configuring it
            T2CONbits.CKPS = (uint8_t)preScaleExponent;  // Set the Timer2 prescaler
            T2CONbits.OUTPS = (uint8_t)(postscaler - 1); // Set the Timer2 postscaler
            T2TMR = 0;
            T2PR = (uint8_t)timerTicks; // Set the Timer2 register to the calculated number of ticks
            T2HLT = 0;                  // Set the Timer2 hardware limit to 0 (no limit)
            T2HLTbits.PSYNC =
                1; // Set the Timer2 hardware limit to synchronize with the system clock
            T2CLKCONbits.T2CS = 0x01; // Set the Timer2 clock source to FOSC/4
            T2RST = 0;                // Set the Timer2 reset source to none
            break;
        case TIMER4:
            T4CONbits.TMR4ON = 0;                        // Disable Timer4 before configuring it
            T4CONbits.CKPS = (uint8_t)preScaleExponent;  // Set the Timer4 prescaler
            T4CONbits.OUTPS = (uint8_t)(postscaler - 1); // Set the Timer4 postscaler
            T4TMR = 0;
            T4PR = (uint8_t)timerTicks; // Set the Timer4 register to the calculated number of ticks
            T4HLT = 0;                  // Set the Timer4 hardware limit to 0 (no limit)
            T4HLTbits.PSYNC =
                1; // Set the Timer4 hardware limit to synchronize with the system clock
            T4CLKCONbits.T4CS = 0x01; // Set the Timer4 clock source to FOSC/4
            T4RST = 0;                // Set the Timer4 reset source to none
            break;
        case TIMER6:
            T6CONbits.TMR6ON = 0;                        // Disable Timer6 before configuring it
            T6CONbits.CKPS = (uint8_t)preScaleExponent;  // Set the Timer6 prescaler
            T6CONbits.OUTPS = (uint8_t)(postscaler - 1); // Set the Timer6 postscaler
            T6TMR = 0;
            T6PR = (uint8_t)timerTicks; // Set the Timer6 register to the calculated number of ticks
            T6HLT = 0;                  // Set the Timer6 hardware limit to 0 (no limit)
            T6HLTbits.PSYNC =
                1; // Set the Timer6 hardware limit to synchronize with the system clock
            T6CLKCONbits.T6CS = 0x01; // Set the Timer6 clock source to FOSC/4
            T6RST = 0;                // Set the Timer6 reset source to none
            break;
        default:
            handle->lastStatus =
                I2C_INVALID_TIMEOUT_SOURCE;    // Set the last state to invalid timeout source
            return I2C_INVALID_TIMEOUT_SOURCE; // Return an error code indicating that the timeout
                                               // source is invalid
        }
    }

    // If the clock source is the system oscillator (FOSC), the system clock / 4 (FOSC/4), or the
    // Hight Frequency Internal Oscillator (HFINTOSC), we will set the I2C fast mode.  Otherwise
    // we will leave it in normal mode.
    bool fastMode = false;
    if (clockSource == I2C_CLOCK_FOSC || clockSource == I2C_CLOCK_FOSC_DIV_4 ||
        clockSource == I2C_CLOCK_HFINTOSC)
    {
        fastMode = true; // Set the fast mode flag
    }

    if (handle->channel == I2C_CHANNEL_1)
    {
        CRITICAL_SECTION_START();
        I2C1CON0 = 0;                              // Reset I2C1 control register
        I2C1CON0bits.MODE = (uint8_t)handle->mode; // Set the I2C mode (master/slave)
        I2C1CON1 = 0;                              // Reset I2C1 control register
        I2C1CON2 = 0;                              // Reset I2C1 control register
        I2C1CON2bits.FME = fastMode ? 1 : 0;       // Set the I2C fast mode bit
        I2C1CLK = (uint8_t)handle->clockSource;    // Set the I2C clock source
        I2C1PIE = 0;                               // Disable I2C1 condition interrupts
        I2C1ERRbits.BTOIE = 1;                     // Enable I2C1 bus timeout interrupt
        I2C1ERRbits.BCLIE = 1;                     // Enable I2C1 bus collision interrupt
        I2C1ERRbits.NACKIE = 1;                    // Enable I2C1 NACK interrupt
        I2C1PIE = 0;                               // Disable I2C1 general interrupts
        I2C1PIEbits.CNTIE = 1;                     // Enable I2C1 count interrupt
        I2C1PIR = 0;                               // Clear I2C1 interrupt flags
        I2C1ERR = 0;                               // Clear I2C1 error flags
        I2C1CNT = 0;                               // Reset I2C1 count register
        if (handle->timeoutSource != NONE)
        {
            // Set the I2C1 bus timeout register to the specified timeout value
            I2C1BTO = (uint8_t)handle->timeout;
        }

        // Ensure I2C transfer pacing can preempt low-priority ISRs that may
        // initiate I2C operations (for example INT1 handler).
        IPR7bits.I2C1EIP = 1;
        IPR7bits.I2C1IP = 1;
        IPR7bits.I2C1TXIP = 1;
        IPR7bits.I2C1RXIP = 1;

        PIE7bits.I2C1EIE = 1;  // Enable I2C1 Error Interrupt Enable
        PIE7bits.I2C1TXIE = 1; // Enable I2C1 Transmit Interrupt Enable
        PIE7bits.I2C1RXIE = 1; // Enable I2C1 Receive Interrupt Enable
        PIE7bits.I2C1IE = 1;   // Enable I2C1 General Interrupt Enable
        CRITICAL_SECTION_END();

        I2C1CON0bits.EN = 1; // Enable the channel
    }
#ifdef I2C2CON0
    if (handle->channel == I2C_CHANNEL_2)
    {
        CRITICAL_SECTION_START();
        I2C2CON0 = 0;                              // Reset I2C2 control register
        I2C2CON0bits.MODE = (uint8_t)handle->mode; // Set the I2C mode (master/slave)
        I2C2CON1 = 0;                              // Reset I2C2 control register
        I2C2CON2 = 0;                              // Reset I2C2 control register
        I2C2CON2bits.FME = fastMode ? 1 : 0;       // Set the I2C fast mode bit
        I2C2CLK = (uint8_t)handle->clockSource;    // Set the I2C clock source
        I2C2PIE = 0;                               // Disable I2C2 interrupts
        I2C2PIEbits.CNTIE = 1;                     // Enable I2C2 count interrupt
        I2C2PIR = 0;                               // Clear I2C2 interrupt flags
        I2C2ERRbits.BTOIE = 1;                     // Enable I2C2 bus timeout interrupt
        I2C2ERRbits.BCLIE = 1;                     // Enable I2C2 bus collision interrupt
        I2C2ERRbits.NACKIE = 1;                    // Enable I2C2 NACK interrupt
        I2C2CNT = 0;                               // Reset I2C2 count register

        IPR6bits.I2C2EIP = 1;
        IPR6bits.I2C2IP = 1;
        IPR6bits.I2C2TXIP = 1;
        IPR6bits.I2C2RXIP = 1;

        PIE6bits.I2C2EIE = 1;  // Enable I2C2 Error Interrupt Enable
        PIE6bits.I2C2TXIE = 1; // Enable I2C2 Transmit Interrupt Enable
        PIE6bits.I2C2RXIE = 1; // Enable I2C2 Receive Interrupt Enable
        PIE6bits.I2C2IE = 1;   // Enable I2C2 General Interrupt Enable
        CRITICAL_SECTION_END();

