dewayne57/PIC18F__Q43/03 I2C/I2C 02 Module Host/i2c.c
/// @brief Handle I2C transmit interrupts.  This function writes the next byte of data to the
/// I2C transmit buffer and updates the I2C handle structure.  If all data has been transmitted,
/// the function disables the transmit interrupt and sets the I2C bus state to idle.  If the
/// function is in read register mode, it leaves the transition to read mode to the general
/// interrupt path after the write byte count reaches zero.
/// @param handle Pointer to the I2C handle structure.
/// @return None
void handleTransmitInterrupt(I2C_Handle_t* handle)
{
    if (!isHandleValid(handle))
    {
        return; // Handle is NULL, exit the function
    }

    if (handle->state != I2C_WRITE && handle->state != I2C_READ_REGISTER)
    {
        return; // Not in write mode, exit the ISR
    }

    if (handle->txBufferIndex < handle->txBufferSize)
    {
        // There is data to transmit
        I2C1TXB = handle->txBuffer[handle->txBufferIndex++];
        I2C1CON0bits.CSTR = 0;
    }
    else
    {
        // If TXB emptied before CNT reaches zero, the module may stretch SCL
        // waiting for software service. Explicitly release stretching so the
        // ACK/NACK clock can complete.
        I2C1CON0bits.CSTR = 0;

        if (handle->state == I2C_READ_REGISTER)
        {
            // Transition to read phase is handled by general interrupt on CNT completion.
            PIE7bits.I2C1TXIE = 0;
        }
        // Complete write-only transfer once hardware count is fully done.
        else if (I2C1CNT == 0)
        {
            handle->state = I2C_IDLE;
            PIE7bits.I2C1TXIE = 0; // Disable TX interrupt after final count completion
        }
    }
}

/// @brief Cache the I2C handle for the specified channel.
/// @param handle Pointer to the I2C handle structure to be cached.
static void cacheHandle(I2C_Handle_t* handle)
{
    if (!isHandleValid(handle))
    {
        return;
    }
    if (handle->channel == I2C_CHANNEL_1)
    {
        i2cHandles[0] = handle;
    }
    else if (handle->channel == I2C_CHANNEL_2)
    {
        i2cHandles[1] = handle;
    }
}